import re
from collections import Counter

import numpy as np


def count_freq(text, lang):
    exp_freq = {
        'RUS': {'А': 0.0800, 'Б': 0.0159, 'В': 0.0454, 'Г': 0.0170, 'Д': 0.0298, 'Е': 0.0845, 'Ё': 0.0004, 'Ж': 0.0094,
                'З': 0.0165, 'И': 0.0735, 'Й': 0.0121, 'К': 0.0349, 'Л': 0.0440, 'М': 0.0321, 'Н': 0.0670, 'О': 0.1097,
                'П': 0.0281, 'Р': 0.0473, 'С': 0.0547, 'Т': 0.0626, 'У': 0.0262, 'Ф': 0.0026, 'Х': 0.0097, 'Ц': 0.0048,
                'Ч': 0.0144, 'Ш': 0.0073, 'Щ': 0.0036, 'Ъ': 0.0004, 'Ы': 0.0190, 'Ь': 0.0174, 'Э': 0.0032, 'Ю': 0.0064,
                'Я': 0.0201},
        # {' ': 0.175, 'О': 0.09, 'Е': 0.072, 'А': 0.062, 'И': 0.062, 'Н': 0.053, 'Т': 0.053, 'С': 0.045,
        #     'Р': 0.04, 'В': 0.038, 'Л': 0.035, 'К': 0.028, 'М': 0.026, 'Д': 0.025, 'П': 0.023, 'У': 0.021,
        #     'Я': 0.018, 'Ы': 0.016, 'З': 0.016, 'Ъ': 0.014, 'Б': 0.014, 'Г': 0.013, 'Ч': 0.012, 'Й': 0.01,
        #     'Х': 0.009, 'Ж': 0.007, 'Ю': 0.006, 'Ш': 0.006, 'Ц': 0.004, 'Щ': 0.003, 'Э': 0.003,
        #     'Ф': 0.002},
        'ENG': {'A': 0.0804, 'B': 0.0154, 'C': 0.0306, 'D': 0.0399, 'E': 0.1251, 'F': 0.0230, 'G': 0.0196,
                'H': 0.0549, 'I': 0.0726, 'J': 0.0016, 'K': 0.0067, 'L': 0.0414, 'M': 0.0253, 'N': 0.0709,
                'O': 0.0760, 'P': 0.0200, 'Q': 0.0011, 'R': 0.0612, 'S': 0.0654, 'T': 0.0925, 'U': 0.0271,
                'V': 0.0099, 'W': 0.0192, 'X': 0.0019, 'Y': 0.0173, 'Z': 0.0009}
    }

    if lang == 'ENG':
        text = re.sub(r'[^A-Z]', '', text)
    else:
        text = re.sub(r'[^А-ЯЁ]', '', text)

    dictionary = Counter(text)

    for letter in exp_freq[lang]:
        if letter not in dictionary.keys():
            dictionary[letter] = 0

    number_of_appearances = list(zip(*sorted(dictionary.items(), key=lambda x: x[0])))[1]
    freqs = np.array(number_of_appearances) / np.sum(number_of_appearances)

    exp_freqs = np.array(list(exp_freq[lang].values()))

    return freqs, exp_freqs
